package polymorphismAndInheritance.staticMethods;

public class Main {
//    Статические методы связаны с классом, а не с экземпляром объекта.
//    Во время компиляции компилятор знает, какой статический метод будет вызван,
//    так как он связан с конкретным классом, а не с объектом.
//    Динамический полиморфизм работает на уровне объектов,
//    где метод вызывается в зависимости от фактического типа объекта.
//    Динамический полиморфизм невозможен для статических методов, так как они не принадлежат объектам.
}
